#################
## 이미지 포멧 변환
##################
# dog.jpg 파일을 열어서 dogs.png 형식으로 저장하는 함수 만들기
# 함수 이름 : 이미지_확장자_변환()
#################
## 밝은 이미지 사진 만들기
##################
# dog.jpg 파일을 2배로 밝게 만들어 저장하는 함수 만들기
# 함수 이름 : 이미지_밝게만들기()
# 밝기 조절 : 2.0배
# 저장 파일명 : dog_bright_2.0.png
# 참고 : 맨 마지막에 존재하는 . 이외의 점들은 모두 파일명칭으로 사용됨
#################
## 필터 세트
##################
# dog.jpg 3가지 필터를 적용해서 저장하는 함수 만들기
# 함수 이름 : 필터_세트()
# 선명도 -> Sharpness  Blur Smooth
# 흐림 = Blur    하지만 흐림 -> sharp 조절해서 사용하기도 함
# 보통 blur 를 흐림으로 사용하지만, 상황에 따라 sharm smooth 조절해서 사용
# 흐림효과 1.3  선명효과 1.5  채도 조절 2.35
# 저장 파일명 : dog_filter.png